# Importing Libraries

In [1]:
import pandas as pd
import scipy 
import numpy as np
from scipy import stats
from scipy.stats import norm
import statsmodels.api as sm
from scipy.stats import chi2_contingency

In [2]:
ls

 Volume in drive C has no label.
 Volume Serial Number is A239-1DCD

 Directory of C:\Users\HP\Documents\EXCELR ASSIGNMENTS\Hypothesis Testing Assigment

10-01-2023  16:41    <DIR>          .
10-01-2023  16:41    <DIR>          ..
02-01-2023  10:41    <DIR>          .ipynb_checkpoints
05-12-2022  10:52                87 BuyerRatio.csv
05-12-2022  10:53            13,423 Costomer+OrderForm.csv
05-12-2022  10:52               525 Cutlets.csv
10-01-2023  16:41            29,244 Hypothesis Testing Assinment.ipynb
05-12-2022  10:53            61,688 Hypothesis_Testing_Assignment.pptx
05-12-2022  10:52             3,487 LabTAT.csv
               6 File(s)        108,454 bytes
               3 Dir(s)  157,441,638,400 bytes free

# Q.1.

Ho: μ1 = μ2 (There is no significant difference in diameters of cutlets between two units)
Ha: μ1 != μ2 (There is significant difference in diameters of cutlets between two units)

# Importing Data

In [3]:
Cutlets = pd.read_csv('Cutlets.csv')
Cutlets.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

# EDA

In [4]:
Cutlets.shape

(35, 2)

In [5]:
Cutlets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [6]:
Cutlets.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [7]:
UnitA=pd.Series(Cutlets.iloc[:,0])
UnitA

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [8]:
UnitB=pd.Series(Cutlets.iloc[:,1])
UnitB

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

# 2-Sample T-test

In [9]:
p_value=stats.ttest_ind(UnitA,UnitB,alternative="two-sided")
p_value

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

# Inference

We have alpha=0.05 and we get p value=0.472
So, by comparing both alpha and p value we get p value is greater than alpha
i.e. p value>alpha .
Thus,we accept null hypothesis Ho:μ1 = μ2 as There is no significant difference in diameters of cutlets between two units.

# Q.2.

Ho: There is no significant difference in average TAT among the different laboratories.
Ha: There is significant difference in average TAT among the different laboratories.

# Importing Data

In [10]:
LabTab=pd.read_csv("LabTAT.csv")
LabTab.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

# P Value

In [11]:
p_value=stats.f_oneway(LabTab.iloc[:,0],LabTab.iloc[:,1],LabTab.iloc[:,2],LabTab.iloc[:,3])
p_value

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

# Inference

We have alpha=0.05 and we get p value=2.1156708949992414e-57
So, by comparing both alpha and p value we get p value is less than alpha
i.e. p value<alpha.
Thus,we reject null hypothesis Ho and accept alternate hypothesis Ha as there is difference in average TAT among the different laboratories.

# Q.3.

Ho:All proportions are equal.
Ha:All proportions are not equal.

# Importing Data

In [12]:
BuyerRatio=pd.read_csv('BuyerRatio.csv')
BuyerRatio.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

# P value

In [13]:
Table=[50,142,131,70],[435,1523,1356,750]

In [14]:
# Chi2 contengency independence test 
# o/p is (Chi2 stats value, p_value, df, expected values)
chi2_contingency(Table)

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
        [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

# Inference

We have alpha=0.05 and we get p value=0.6603
So, by comparing both alpha and p value we get p value is greater than alpha
i.e. p value>alpha.
Thus,we accept null hypothesis Ho as All proportions are equal.

# Q.4.

 Ho: Independence of categorical variables (customer order forms defective % does not varies by centre).
 Ha: Dependence of categorical variables (customer order forms defective % varies by centre).

# Importing Data

In [15]:
centers=pd.read_csv('Costomer+OrderForm.csv')
centers

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

# EDA

In [16]:
centers.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [17]:
centers.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [18]:
centers.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [19]:
centers.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [20]:
centers.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

# P Value

In [21]:
Table=([[271,267,269,280],[29,33,31,20]])

In [22]:
chi2_contingency(Table)

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[271.75, 271.75, 271.75, 271.75],
        [ 28.25,  28.25,  28.25,  28.25]]))

# Inference

We have alpha=0.05 and we get p value=0.2771
So, by comparing both alpha and p value we get p value is greater than alpha
i.e. p value>alpha .
Thus,we accept null hypothesis Ho so customer order forms defective % does not varies by centre.